manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool decodeMeshtasticData(const uint8_t* plain, size_t plain_len, meshtastic_Data* out_decoded)
{
    if (!plain || plain_len == 0 || !out_decoded)
    {
        return false;
    }

    *out_decoded = meshtastic_Data_init_zero;
    pb_istream_t stream = pb_istream_from_buffer(plain, plain_len);
    return pb_decode(&stream, meshtastic_Data_fields, out_decoded);
}

bool isPlausibleDecodedData(const meshtastic_Data& decoded)
{
    if (decoded.portnum == meshtastic_PortNum_UNKNOWN_APP ||
        decoded.portnum > meshtastic_PortNum_MAX)
    {
        return false;
    }

    return decoded.payload.size > 0 ||
           decoded.request_id != 0 ||
           decoded.reply_id != 0 ||
           decoded.want_response ||
           decoded.has_bitfield ||
           decoded.portnum == meshtastic_PortNum_ROUTING_APP;
}

bool tryDecodeWithChannelKey(const ::chat::MeshConfig& config,
                             ::chat::ChannelId channel,
                             const ::chat::meshtastic::PacketHeaderWire& header,
                             const uint8_t* payload,
                             size_t payload_size,
                             uint8_t* out_plain,
                             size_t* inout_plain_len,
                             meshtastic_Data* out_decoded,
                                const uint8_t** out_key,
                                size_t* out_key_len)
{
    if (!out_decoded)
    {
        return false;
    }

    if (!payload || !out_plain || !inout_plain_len || !out_decoded)
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config, channel, &key_len);
    size_t plain_len = *inout_plain_len;

    if (key && key_len > 0)
    {
        if (!::chat::meshtastic::decryptPayload(header,
                                                payload,
                                                payload_size,
                                                key,
                                                key_len,
                                                out_plain,
                                                &plain_len))
        {
            return false;
        }
    }
    else
    {
        if (plain_len < payload_size)
        {
            *inout_plain_len = payload_size;
            return false;
        }

        std::memcpy(out_plain, payload, payload_size);
        plain_len = payload_size;
    }

    *out_decoded = meshtastic_Data_init_zero;
    if (!decodeMeshtasticData(out_plain, plain_len, out_decoded) ||
        !isPlausibleDecodedData(*out_decoded))
    {
        return false;
    }

    *inout_plain_len = plain_len;
    if (out_key)
    {
        *out_key = key;
    }
    if (out_key_len)
    {
        *out_key_len = key_len;
    }
    return true;
}

bool resolvePacketWithKnownKeys(const ::chat::MeshConfig& config,
                                const ::chat::meshtastic::PacketHeaderWire& header,
                                const uint8_t* payload,
                                size_t payload_size,
                                bool skip_channel,
                                ::chat::ChannelId skipped,
                                ::chat::ChannelId* out_channel,
                                const uint8_t** out_key,
                                size_t* out_key_len,
                                uint8_t* out_plain,
                                size_t* inout_plain_len,
                                meshtastic_Data* out_decoded)
{
    if (!out_decoded)
    {
        return false;
    }

    static constexpr ::chat::ChannelId kCandidates[] = {
        ::chat::ChannelId::PRIMARY,
        ::chat::ChannelId::SECONDARY,
    };

    for (::chat::ChannelId candidate : kCandidates)
    {
        if (skip_channel && candidate == skipped)
        {
            continue;
        }

        size_t candidate_plain_len = *inout_plain_len;
        const uint8_t* key = nullptr;
        size_t key_len = 0;
        if (!tryDecodeWithChannelKey(config,
                                     candidate,
                                     header,
                                     payload,
                                     payload_size,
                                     out_plain,
                                     &candidate_plain_len,
                                     out_decoded,
                                     &key,
                                     &key_len))
        {
            continue;
        }

        *inout_plain_len = candidate_plain_len;
        if (out_channel)
        {
            *out_channel = candidate;
        }
        if (out_key)
        {
            *out_key = key;
        }
        if (out_key_len)
        {
            *out_key_len = key_len;
        }
        return true;
    }

    return false;
}

const uint8_t* selectKeyByHash(const ::chat::MeshConfig& config,
                               uint8_t channel_hash,
                               size_t* out_len,
                               ::chat::ChannelId* out_channel)
{
    if (out_len)
    {
        *out_len = 0;
    }
    if (out_channel)
    {
        *out_channel = ::chat::ChannelId::PRIMARY;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config, ::chat::ChannelId::PRIMARY, &key_len);
    if (::chat::meshtastic::computeChannelHash(channelNameFor(config, ::chat::ChannelId::PRIMARY),
                                               key,
                                               key_len) == channel_hash)
    {
        if (out_len)
        {
            *out_len = key_len;
        }
        return key;
    }

    key = selectKey(config, ::chat::ChannelId::SECONDARY, &key_len);
    if (::chat::meshtastic::computeChannelHash(channelNameFor(config, ::chat::ChannelId::SECONDARY),
                                               key,
                                               key_len) == channel_hash)
    {
        if (out_len)
        {
            *out_len = key_len;
        }
        if (out_channel)
        {
            *out_channel = ::chat::ChannelId::SECONDARY;
        }
        return key;
    }

    return nullptr;
}

