manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    const uint8_t hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    const uint8_t hop_start =
        (header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK) >>
        ::chat::meshtastic::PACKET_FLAGS_HOP_START_SHIFT;
    const bool is_broadcast = (header.to == kBroadcastNode);
    const bool to_us = (header.to == node_id_);
    const bool to_us_or_broadcast = to_us || is_broadcast;

    if (header.from == node_id_)
    {
        const auto pending_it = pending_retransmits_.find(pendingKey(header.from, header.id));
        if (is_broadcast && pending_it != pending_retransmits_.end())
        {
            logMeshtasticRx("[gat562][mt] implicit-ack observed self-broadcast id=%08lX relay=%u next=%u ch=%u\n",
                            static_cast<unsigned long>(header.id),
                            static_cast<unsigned>(header.relay_node),
                            static_cast<unsigned>(header.next_hop),
                            static_cast<unsigned>(header.channel));
            ::chat::RxMeta implicit_rx{};
            implicit_rx.rx_timestamp_ms = millis();
            implicit_rx.rx_timestamp_s = nowSeconds();
            implicit_rx.time_source = ::chat::RxTimeSource::DeviceUtc;
            implicit_rx.origin = ::chat::RxOrigin::Mesh;
            implicit_rx.channel_hash = header.channel;
            implicit_rx.next_hop = header.next_hop;
            implicit_rx.relay_node = header.relay_node;
            pending_retransmits_.erase(pending_it);
            emitRoutingResult(header.id,
                              meshtastic_Routing_Error_NONE,
                              node_id_,
                              node_id_,
                              channel,
                              header.channel,
                              &implicit_rx);
            return;
        }

        logMeshtasticRx("[gat562][mt] self drop from=%08lX id=%lu relay=%u ch=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(header.relay_node),
                        static_cast<unsigned>(header.channel));
        return;
    }

    ::chat::RxMeta rx_meta{};
    rx_meta.rx_timestamp_ms = millis();
    rx_meta.rx_timestamp_s = nowSeconds();
    rx_meta.time_source = ::chat::RxTimeSource::DeviceUtc;
    rx_meta.from_is =
        (header.flags & ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK) != 0;
    rx_meta.origin = rx_meta.from_is ? ::chat::RxOrigin::External : ::chat::RxOrigin::Mesh;
    rx_meta.direct = (::chat::meshtastic::computeHopsAway(header.flags) == 0);
    rx_meta.hop_count = (hop_start >= hop_limit) ? static_cast<uint8_t>(hop_start - hop_limit) : 0;
    rx_meta.hop_limit = hop_limit;
    rx_meta.channel_hash = header.channel;
    rx_meta.wire_flags = header.flags;
    if (!std::isnan(last_rx_rssi_))
    {
        rx_meta.rssi_dbm_x10 = static_cast<int16_t>(last_rx_rssi_ * 10.0f);
    }
    if (!std::isnan(last_rx_snr_))
    {
        rx_meta.snr_db_x10 = static_cast<int16_t>(last_rx_snr_ * 10.0f);
    }
    rx_meta.next_hop = header.next_hop;
    rx_meta.relay_node = header.relay_node;

    if (!decoded_ok)
    {
        decoded_ok = decodeMeshtasticData(plain, plain_len, &decoded);
        if (!decoded_ok && header.channel != 0 && key)
        {
            size_t probe_plain_len = sizeof(plain);
            if (resolvePacketWithKnownKeys(config_,
                                           header,
                                           payload,
                                           payload_size,
                                           true,
                                           channel,
                                           &channel,
                                           &key,
                                           &key_len,
                                           plain,
                                           &probe_plain_len,
                                           &decoded))
            {
                plain_len = probe_plain_len;
                decoded_ok = true;
                logMeshtasticRx("[gat562][mt] hash collision fallback from=%08lX to=%08lX id=%lu rx_ch=%u via=%s\n",
                                static_cast<unsigned long>(header.from),
                                static_cast<unsigned long>(header.to),
                                static_cast<unsigned long>(header.id),
                                static_cast<unsigned>(header.channel),
                                channelDebugLabel(channel));
            }
        }
    }

    if (decoded_ok)
    {
        logMeshtasticRx("[gat562][mt] decoded from=%08lX to=%08lX id=%lu port=%u ch=%u hop=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.to),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(decoded.portnum),
                        static_cast<unsigned>(header.channel),
                        static_cast<unsigned>(hop_limit));
    }
    else
    {
        logMeshtasticRx("[gat562][mt] pb decode fail from=%08lX to=%08lX id=%lu plain=%u ch=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.to),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(plain_len),
                        static_cast<unsigned>(header.channel));
    }

    if (decoded_ok)
    {
        queueMqttProxyPublishFromWire(data, size, &decoded, channel);
    }

    updateNodeLastSeen(header.from, ::chat::meshtastic::computeHopsAway(header.flags), channel);

    if (decoded_ok && decoded.portnum == meshtastic_PortNum_ROUTING_APP && decoded.payload.size > 0)
    {
        handleRoutingPacket(header, decoded, channel, key, key_len, rx_meta);
    }

    maybeHandleObservedRelay(header);
    const bool duplicate = history.seen_recently && !history.was_upgraded;
    auto apply_observed_node_update = [&](::chat::NodeId node_id, const ::chat::contacts::NodeUpdate& update)
    {
        if (contact_service_)
        {
            contact_service_->applyNodeUpdate(node_id, update);
        }
        else if (node_store_)
        {
            node_store_->applyUpdate(node_id, update);
        }
    };

    if (decoded_ok &&
        ::chat::meshtastic::isNodeMetadataPayload(decoded.portnum) &&
        decoded.payload.size > 0 &&
        (node_store_ || contact_service_))
    {
        ::chat::meshtastic::NodePayloadDecodeContext context{};
        context.fallback_node_id = header.from;
        context.snr = last_rx_snr_;
        context.rssi = last_rx_rssi_;
        context.timestamp = nowSeconds();
        context.hops_away = ::chat::meshtastic::computeHopsAway(header.flags);
        context.channel = static_cast<uint8_t>(channel);
        context.via_mqtt =
            (header.flags & ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK) != 0;

        ::chat::meshtastic::DecodedNodePayload node{};
        if (::chat::meshtastic::decodeNodeMetadataPayload(decoded, context, &node))
        {
            if (node.node_id != 0)
            {
                const ::chat::contacts::NodeUpdate update = node.toNodeUpdate();
                if (!duplicate || history.was_fallback)
                {
                    apply_observed_node_update(node.node_id, update);
                    if (node.has_public_key)
                    {
                        savePkiNodeKey(node.node_id,
                                       node.public_key.data(),
                                       node.public_key.size());
                    }
                }
                nodeinfo_last_seen_ms_[node.node_id] = millis();
                maybeBroadcastNodeInfoAfterPeerAnnouncement(node.node_id,
                                                            millis(),
                                                            channel,
                                                            node.via_mqtt);

                if (!node.short_name.empty() || !node.long_name.empty())
                {
                    logMeshtasticRx("[gat562][mt] node metadata observed port=%u from=%08lX owner=%08lX short=\"%s\" long=\"%s\"\n",
                                    static_cast<unsigned>(decoded.portnum),
                                    static_cast<unsigned long>(header.from),
                                    static_cast<unsigned long>(node.node_id),
                                    node.short_name.c_str(),
                                    node.long_name.c_str());
                }
                else
                {
                    logMeshtasticRx("[gat562][mt] node metadata observed port=%u from=%08lX owner=%08lX\n",
                                    static_cast<unsigned>(decoded.portnum),
                                    static_cast<unsigned long>(header.from),
                                    static_cast<unsigned long>(node.node_id));
                }
            }
        }
        else
        {
            logMeshtasticRx("[gat562][mt] node metadata decode fail port=%u from=%08lX payload=%u\n",
                            static_cast<unsigned>(decoded.portnum),
                            static_cast<unsigned long>(header.from),
                            static_cast<unsigned>(decoded.payload.size));
        }
    }

    if (decoded_ok &&
        decoded.portnum == meshtastic_PortNum_POSITION_APP &&
        decoded.payload.size > 0 &&
        contact_service_)
    {
        ::chat::meshtastic::DecodedPositionPayload position{};
        if (::chat::meshtastic::decodePositionPayload(decoded,
                                                      header.from,
                                                      nowSeconds(),
                                                      &position))
        {
            contact_service_->updateNodePosition(position.node_id, position.position);
        }
        else
        {
            logMeshtasticRx("[gat562][mt] position decode fail from=%08lX payload=%u\n",
                            static_cast<unsigned long>(header.from),
                            static_cast<unsigned>(decoded.payload.size));
        }
    }

    if (decoded_ok && header.channel != 0 && header.from != node_id_)
    {
        node_last_channel_[header.from] = channel;
    }

    if (want_ack_flag && to_us && decoded_ok)
    {
        (void)sendRoutingAck(header.from, header.id, header.channel, channel, key, key_len, 0);
    }

    const bool want_response =
        decoded_ok &&
        (decoded.want_response ||
         (decoded.has_bitfield && ((decoded.bitfield & kBitfieldWantResponseMask) != 0)));

