manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    if (decoded_ok)
    {
        ::chat::runtime::IncomingPacket runtime_packet{};
        runtime_packet.protocol = ::chat::MeshProtocol::Meshtastic;
        runtime_packet.channel = channel;
        runtime_packet.from = header.from;
        runtime_packet.to = header.to;
        runtime_packet.packet_id = header.id;
        runtime_packet.request_id = decoded.request_id;
        runtime_packet.portnum = decoded.portnum;
        runtime_packet.want_response = want_response;
        runtime_packet.encrypted = key_len > 0;
        runtime_packet.payload.assign(decoded.payload.bytes,
                                      decoded.payload.bytes + decoded.payload.size);
        runtime_packet.rx_meta = rx_meta;
        (void)executeProtocolEffects(
            protocol_runtime_.handleIncomingPacket(
                                 runtime_packet,
                                 buildProtocolRuntimeContext())
                .effects);
    }

    if (decoded_ok && decoded.portnum == meshtastic_PortNum_KEY_VERIFICATION_APP && decoded.payload.size > 0)
    {
        meshtastic_KeyVerification kv = meshtastic_KeyVerification_init_zero;
        bool handled = false;

        if (header.channel == 0 && ::chat::meshtastic::decodeKeyVerificationMessage(plain, plain_len, &kv))
        {
            if (kv.hash1.size == 0 && kv.hash2.size == 0)
            {
                handled = handleKeyVerificationInit(header, kv);
            }
            else if (kv.hash1.size == 0 && kv.hash2.size == 32)
            {
                handled = handleKeyVerificationReply(header, kv);
            }
            else if (kv.hash1.size == 32 && kv.hash2.size == 0)
            {
                handled = handleKeyVerificationFinal(header, kv);
            }
        }

        if (!handled)
        {
            logMeshtasticRx("[gat562][mt] key verification ignored from=%08lX stage=%s\n",
                            static_cast<unsigned long>(header.from),
                            keyVerificationStage(kv));
        }
    }

    if (decoded_ok && decoded.portnum == meshtastic_PortNum_NODEINFO_APP)
    {
        const uint32_t now_ms = millis();
        const auto it = nodeinfo_reply_ms_.find(header.from);
        const uint32_t last_reply_ms =
            (it != nodeinfo_reply_ms_.end()) ? it->second : 0;
        const auto reply_policy = ::chat::runtime::resolveMeshtasticNodeInfoReplyPolicy(
            want_response, to_us_or_broadcast, now_ms, last_reply_ms);
        if (reply_policy.should_reply)
        {
            if (buildAndQueueNodeInfo(header.from, false, channel))
            {
                nodeinfo_reply_ms_[header.from] = now_ms;
            }
        }
    }

    if (!duplicate || history.was_fallback)
    {
        (void)maybeRebroadcast(header, payload, payload_size, channel, decoded_ok ? &decoded : nullptr);
    }

    if (!to_us_or_broadcast || duplicate)
    {
        return;
    }

    const bool is_text_port =
        decoded_ok &&
        (decoded.portnum == meshtastic_PortNum_TEXT_MESSAGE_APP ||
         decoded.portnum == meshtastic_PortNum_TEXT_MESSAGE_COMPRESSED_APP);
    const bool text_compressed =
        decoded_ok && (decoded.portnum == meshtastic_PortNum_TEXT_MESSAGE_COMPRESSED_APP);

    if (is_text_port)
    {
        logMeshtasticRx("[gat562][mt][text] rx from=%08lX to=%08lX id=%lu port=%u payload=%u plain=%u compressed=%u encrypted=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.to),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(decoded.portnum),
                        static_cast<unsigned>(decoded.payload.size),
                        static_cast<unsigned>(plain_len),
                        text_compressed ? 1U : 0U,
                        key_len > 0 ? 1U : 0U);
    }

    ::chat::MeshIncomingText incoming{};
    if (decoded_ok && ::chat::meshtastic::decodeTextPayload(decoded, &incoming))
    {
        incoming.from = header.from;
        incoming.to = header.to;
        incoming.msg_id = header.id;
        incoming.channel = channel;
        incoming.timestamp = (rx_meta.rx_timestamp_s != 0) ? rx_meta.rx_timestamp_s : nowSeconds();
        incoming.encrypted = key_len > 0;
        incoming.hop_limit = hop_limit;
        incoming.rx_meta = rx_meta;

        logMeshtasticRx("[gat562][mt] text queued from=%08lX to=%08lX id=%lu port=%u payload=%u compressed=%u len=%u text=\"%s\"\n",
                        static_cast<unsigned long>(incoming.from),
                        static_cast<unsigned long>(incoming.to),
                        static_cast<unsigned long>(incoming.msg_id),
                        static_cast<unsigned>(decoded.portnum),
                        static_cast<unsigned>(decoded.payload.size),
                        text_compressed ? 1U : 0U,
                        static_cast<unsigned>(incoming.text.size()),
                        incoming.text.c_str());

        bool dropped = false;
        text_queue_.pushDropOldest(std::move(incoming), &dropped);
        if (dropped)
        {
            logMeshtasticRx("[gat562][mt] text queue dropped oldest depth=%u\n",
                            static_cast<unsigned>(text_queue_.size()));
        }
        return;
    }

    if (is_text_port)
    {
        logMeshtasticRx("[gat562][mt] text decode fail from=%08lX id=%lu port=%u payload=%u plain=%u compressed=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(decoded.portnum),
                        static_cast<unsigned>(decoded.payload.size),
                        static_cast<unsigned>(plain_len),
                        text_compressed ? 1U : 0U);
    }

    ::chat::MeshIncomingData app_data{};
    if (decoded_ok &&
        decoded.portnum != meshtastic_PortNum_TRACEROUTE_APP &&
        ::chat::meshtastic::decodeAppPayload(decoded, &app_data))
    {
        app_data.from = header.from;
        app_data.to = header.to;
        app_data.packet_id = header.id;
        app_data.request_id = decoded.request_id;
        app_data.channel = channel;
        app_data.channel_hash = header.channel;
        app_data.hop_limit = hop_limit;
        app_data.want_response = want_response;
        app_data.rx_meta = rx_meta;

