manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool MeshtasticRadioAdapter::sendProtocolPacketEffect(
    const ::chat::runtime::SendPacketEffect& packet)
{
    const uint8_t* payload = packet.payload.empty() ? nullptr : packet.payload.data();
    const size_t payload_len = packet.payload.size();
    if (packet.response_request_id == 0)
    {
        return sendAppData(packet.channel,
                           packet.portnum,
                           payload,
                           payload_len,
                           packet.dest,
                           packet.want_ack,
                           packet.request_id,
                           packet.want_response);
    }

    if (!isReady() || !config_.tx_enabled)
    {
        return false;
    }

    ::chat::ChannelId out_channel = packet.channel;
    if (packet.portnum == meshtastic_PortNum_POSITION_APP &&
        (encrypt_mode_ == 0 || encrypt_mode_ == 2))
    {
        out_channel = ::chat::ChannelId::PRIMARY;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);

    meshtastic_Data& data = scratch.decoded;
    data = meshtastic_Data_init_default;
    if (payload_len > sizeof(data.payload.bytes))
    {
        return false;
    }
    data.portnum = static_cast<meshtastic_PortNum>(packet.portnum);
    data.want_response = packet.want_response;
    data.dest = packet.dest;
    data.source = node_id_;
    data.request_id = packet.response_request_id;
    data.has_bitfield = true;
    data.bitfield = packet.want_response ? kBitfieldWantResponseMask : 0;
    data.payload.size = static_cast<pb_size_t>(payload_len);
    if (payload_len > 0)
    {
        std::memcpy(data.payload.bytes, payload, payload_len);
    }

    uint8_t* data_buf = scratch.app_data.data();
    pb_ostream_t dstream = pb_ostream_from_buffer(data_buf, scratch.app_data.size());
    if (!pb_encode(&dstream, meshtastic_Data_fields, &data))
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, out_channel, &key_len);
    const uint8_t channel_hash = channelHashFor(config_, out_channel);

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    const ::chat::MessageId wire_id =
        packet.request_id != 0 ? packet.request_id : next_packet_id_++;
    if (!::chat::meshtastic::buildWirePacket(data_buf,
                                             dstream.bytes_written,
                                             node_id_,
                                             wire_id,
                                             packet.dest,
                                             channel_hash,
                                             config_.hop_limit,
                                             packet.want_ack,
                                             key,
                                             key_len,
                                             wire,
                                             &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire,
                                wire_size,
                                out_channel,
                                &data,
                                packet.want_ack,
                                true);
}

bool MeshtasticRadioAdapter::executeProtocolEffects(const ::chat::runtime::ProtocolEffects& effects)
{
    bool ok = true;
    for (const auto& effect : effects.items)
    {
        ok = executeProtocolEffect(effect) && ok;
    }
    return ok;
}

bool MeshtasticRadioAdapter::executeProtocolEffect(const ::chat::runtime::ProtocolEffect& effect)
{
    bool ok = false;
    ::chat::runtime::visitProtocolEffect(
        effect,
        [this, &ok](const auto& item)
        {
            using Effect = std::decay_t<decltype(item)>;
            if constexpr (std::is_same_v<Effect, ::chat::runtime::SendNodeInfoEffect>)
            {
                ok = buildAndQueueNodeInfo(item.peer, item.want_response, item.channel);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::SendRoutingErrorEffect>)
            {
                size_t key_len = 0;
                const uint8_t* key = selectKey(config_, item.channel, &key_len);
                const uint8_t channel_hash = channelHashFor(config_, item.channel);
                ok = sendRoutingError(item.peer,
                                      item.request_id,
                                      channel_hash,
                                      item.channel,
                                      key,
                                      key_len,
                                      static_cast<meshtastic_Routing_Error>(item.error_code),
                                      0);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::ForgetPeerKeyEffect>)
            {
                forgetNodePublicKey(item.peer);
                ok = true;
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::SendPacketEffect>)
            {
                ok = sendProtocolPacketEffect(item);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::PublishIncomingDataEffect>)
            {
                bool dropped = false;
                data_queue_.pushDropOldest(item.data, &dropped);
                if (dropped)
                {
                    logMeshtasticRx("[gat562][mt] protocol data queue dropped oldest depth=%u\n",
                                    static_cast<unsigned>(data_queue_.size()));
                }
                ok = true;
            }
        });
    return ok;
}

bool MeshtasticRadioAdapter::executePkiResync(::chat::runtime::MeshtasticPkiResyncCause cause,
                                              ::chat::NodeId peer,
                                              ::chat::MessageId request_id,
                                              ::chat::ChannelId channel)
{
    ::chat::runtime::MeshtasticPkiResyncInput input{};
    input.cause = cause;
    input.peer = peer;
    input.request_id = request_id;
    input.channel = channel;
    return executeProtocolEffects(protocol_runtime_.handlePkiResync(input));
}

void MeshtasticRadioAdapter::emitRoutingResult(uint32_t request_id, meshtastic_Routing_Error reason,
                                               ::chat::NodeId from, ::chat::NodeId to,
                                               ::chat::ChannelId channel, uint8_t channel_hash,
                                               const ::chat::RxMeta* rx_meta)
{
    if (request_id == 0)
    {
        return;
    }

    sys::EventBus::publish(
        new sys::ChatSendResultEvent(request_id, reason == meshtastic_Routing_Error_NONE),
        0);

