manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    PacketHistoryEntry* entry = findHistory(header.from, header.id);
    if (!entry)
    {
        if (packet_history_.size() >= kPacketHistoryCapacity)
        {
            packet_history_.erase(packet_history_.begin());
        }
        packet_history_.push_back(PacketHistoryEntry{});
        entry = &packet_history_.back();
        entry->sender = header.from;
        entry->packet_id = header.id;
    }

    entry->last_rx_ms = millis();
    entry->next_hop = header.next_hop;
    entry->highest_hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    entry->our_tx_hop_limit = entry->highest_hop_limit;
    entry->relayed_by.fill(0);
    if (header.relay_node != 0)
    {
        entry->relayed_by[0] = header.relay_node;
    }
}

bool MeshtasticRadioAdapter::maybeRebroadcast(const ::chat::meshtastic::PacketHeaderWire& header,
                                              const uint8_t* payload, size_t payload_size,
                                              ::chat::ChannelId channel, const meshtastic_Data* decoded)
{
    if (!config_.enable_relay || !payload || payload_size == 0)
    {
        return false;
    }
    if (header.from == node_id_ || header.to == node_id_)
    {
        return false;
    }

    uint8_t hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    if (hop_limit == 0)
    {
        return false;
    }

    if (header.next_hop != 0 && header.next_hop != ourRelayId())
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, channel, &key_len);
    auto& scratch = tx_scratch_;
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    const bool want_ack = (header.flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    if (!::chat::meshtastic::buildWirePacket(payload, payload_size,
                                             header.from, header.id, header.to,
                                             header.channel, static_cast<uint8_t>(hop_limit - 1),
                                             want_ack, key, key_len, wire, &wire_size))
    {
        return false;
    }

    auto* out_header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(wire);
    out_header->relay_node = ourRelayId();
    out_header->next_hop = (header.next_hop == ourRelayId()) ? 0 : header.next_hop;
    return transmitPreparedWire(wire, wire_size, channel, decoded, header.next_hop != 0, false, 1);
}

void MeshtasticRadioAdapter::updateNodeLastSeen(::chat::NodeId node_id, uint8_t hops_away, ::chat::ChannelId channel)
{
    if (node_id == 0 || node_id == node_id_ || (!node_store_ && !contact_service_))
    {
        return;
    }

    ::chat::contacts::NodeUpdate update{};
    update.has_last_seen = true;
    update.last_seen = nowSeconds();
    update.has_snr = !std::isnan(last_rx_snr_);
    update.snr = last_rx_snr_;
    update.has_rssi = !std::isnan(last_rx_rssi_);
    update.rssi = last_rx_rssi_;
    update.has_protocol = true;
    update.protocol = static_cast<uint8_t>(::chat::contacts::NodeProtocolType::Meshtastic);
    update.has_role = false;
    update.role = ::chat::contacts::kNodeRoleUnknown;
    update.has_hops_away = hops_away != 0xFFU;
    update.hops_away = hops_away;
    update.has_hw_model = false;
    update.hw_model = 0;
    update.has_channel = true;
    update.channel = static_cast<uint8_t>(channel);

    if (contact_service_)
    {
        contact_service_->applyNodeUpdate(node_id, update);
        return;
    }
    node_store_->applyUpdate(node_id, update);
}

void MeshtasticRadioAdapter::handleRoutingPacket(const ::chat::meshtastic::PacketHeaderWire& header,
                                                 const meshtastic_Data& decoded,
                                                 ::chat::ChannelId channel,
                                                 const uint8_t* key, size_t key_len,
                                                 const ::chat::RxMeta& rx_meta)
{
    (void)key;
    (void)key_len;

    if (decoded.payload.size == 0)
    {
        return;
    }

    meshtastic_Routing routing = meshtastic_Routing_init_default;
    pb_istream_t rstream = pb_istream_from_buffer(decoded.payload.bytes, decoded.payload.size);
    if (!pb_decode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return;
    }

    if (decoded.request_id != 0 && header.to == node_id_)
    {
        const meshtastic_Routing_Error reason =
            (routing.which_variant == meshtastic_Routing_error_reason_tag)
                ? routing.error_reason
                : meshtastic_Routing_Error_NONE;
        (void)stopPendingRetransmit(node_id_, decoded.request_id);
        (void)stopPendingRetransmit(header.from, decoded.request_id);
        emitRoutingResult(decoded.request_id, reason, header.from, header.to, channel, header.channel, &rx_meta);

        bool we_were_sole_relayer = false;
        const PacketHistoryEntry* hist = findHistory(node_id_, decoded.request_id);
        const bool ack_relayer_seen = hist && hasRelayer(*hist, header.relay_node);
        const bool we_were_relayer = hist && hasRelayer(*hist, ourRelayId(), &we_were_sole_relayer);
        if (reason == meshtastic_Routing_Error_NONE)
        {
            if ((we_were_relayer && ack_relayer_seen) ||
                (rx_meta.direct && we_were_sole_relayer) ||
                header.relay_node != 0)
            {
                learnNextHop(header.from, header.relay_node != 0 ? header.relay_node : static_cast<uint8_t>(header.from & 0xFFU));
            }
        }
        else if (reason == meshtastic_Routing_Error_GOT_NAK || reason == meshtastic_Routing_Error_NO_ROUTE)
        {
            if (node_store_)
            {
                node_store_->setNextHop(header.from, 0, nowSeconds());
            }
        }

        if (reason == meshtastic_Routing_Error_PKI_UNKNOWN_PUBKEY ||
            reason == meshtastic_Routing_Error_NO_CHANNEL)
        {
            const auto cause = (reason == meshtastic_Routing_Error_PKI_UNKNOWN_PUBKEY)
                                   ? ::chat::runtime::MeshtasticPkiResyncCause::PeerReportsUnknownPubkey
                                   : ::chat::runtime::MeshtasticPkiResyncCause::PeerReportsNoChannel;
            (void)executePkiResync(cause, header.from, 0, channel);
        }
        return;
    }

    if ((decoded.request_id != 0 || decoded.reply_id != 0) && header.relay_node != 0)
    {
        learnNextHop(header.from, header.relay_node);
    }
}

