manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::queuePendingRetransmit(const ::chat::meshtastic::PacketHeaderWire& header,
                                                    const uint8_t* wire, size_t wire_size,
                                                    ::chat::ChannelId channel,
                                                    bool local_origin, uint8_t retries_override,
                                                    bool observe_only)
{
    if (!wire || wire_size < sizeof(::chat::meshtastic::PacketHeaderWire) || header.id == 0)
    {
        return;
    }

    PendingRetransmit pending{};
    pending.wire.assign(wire, wire + wire_size);
    pending.original_from = header.from;
    pending.dest = header.to;
    pending.packet_id = header.id;
    pending.channel = channel;
    pending.channel_hash = header.channel;
    pending.want_ack = (header.flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    pending.local_origin = local_origin;
    pending.observe_only = observe_only;
    if (observe_only)
    {
        pending.retries_left = 0;
        pending.next_tx_ms = millis() + kImplicitAckTimeoutMs;
    }
    else
    {
        pending.retries_left = retries_override != 0
                                   ? retries_override
                                   : (pending.want_ack ? kDefaultAckRetries : kDefaultNextHopRetries);
        pending.next_tx_ms = millis() + kRetransmitIntervalMs;
    }
    logMeshtasticRx("[gat562][mt] watch pending id=%08lX from=%08lX dest=%08lX observe=%u local=%u want_ack=%u next=%lu\n",
                    static_cast<unsigned long>(pending.packet_id),
                    static_cast<unsigned long>(pending.original_from),
                    static_cast<unsigned long>(pending.dest),
                    pending.observe_only ? 1U : 0U,
                    pending.local_origin ? 1U : 0U,
                    pending.want_ack ? 1U : 0U,
                    static_cast<unsigned long>(pending.next_tx_ms));
    pending_retransmits_[pendingKey(header.from, header.id)] = std::move(pending);
}

bool MeshtasticRadioAdapter::stopPendingRetransmit(::chat::NodeId from, ::chat::MessageId packet_id)
{
    return pending_retransmits_.erase(pendingKey(from, packet_id)) > 0;
}

void MeshtasticRadioAdapter::maybeHandleObservedRelay(const ::chat::meshtastic::PacketHeaderWire& header)
{
    if (header.from == 0 || header.id == 0 || header.relay_node == 0)
    {
        return;
    }

    const PacketHistoryEntry* hist = findHistory(node_id_, header.id);
    if (!hist)
    {
        return;
    }

    if (hist->next_hop != 0 && hist->next_hop == header.relay_node)
    {
        learnNextHop(header.to, header.relay_node);
        (void)stopPendingRetransmit(node_id_, header.id);
    }
}

uint64_t MeshtasticRadioAdapter::pendingKey(::chat::NodeId from, ::chat::MessageId packet_id)
{
    return (static_cast<uint64_t>(from) << 32) | packet_id;
}

bool MeshtasticRadioAdapter::initPkiKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsLocalIdentityStore store;
    ::mesh::LocalIdentity stored_identity{};
    auto loaded = store.load(stored_identity);
    bool have_keys = loaded.ok &&
                     !isZeroKey(stored_identity.private_key,
                                sizeof(stored_identity.private_key));
    if (have_keys)
    {
        std::memcpy(pki_public_key_.data(), stored_identity.public_key, pki_public_key_.size());
        std::memcpy(pki_private_key_.data(), stored_identity.private_key, pki_private_key_.size());
    }

    if (!have_keys)
    {
        RNG.begin("trail-mate");
        auto mac = readMac();
        RNG.stir(mac.data(), mac.size());
        uint32_t noise = random();
        RNG.stir(reinterpret_cast<const uint8_t*>(&noise), sizeof(noise));
        Curve25519::dh1(pki_public_key_.data(), pki_private_key_.data());
        have_keys = !isZeroKey(pki_private_key_.data(), pki_private_key_.size());
        if (have_keys)
        {
            ::mesh::LocalIdentity generated{};
            std::memcpy(generated.public_key, pki_public_key_.data(), sizeof(generated.public_key));
            std::memcpy(generated.private_key, pki_private_key_.data(), sizeof(generated.private_key));
            generated.valid = true;
            (void)store.save(generated);
        }
    }

    return have_keys;
}

void MeshtasticRadioAdapter::loadPkiNodeKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    std::vector<::mesh::PeerPublicKey> keys;
    auto loaded = store.loadAll(keys);
    if (!loaded.ok)
    {
        if (loaded.failure != ::mesh::StoreFailure::NotFound)
        {
            logMeshtasticRx("[gat562][mt] pki key load failed status=%u\n",
                            static_cast<unsigned>(loaded.failure));
        }
        return;
    }

    node_public_keys_.clear();
    node_key_last_seen_.clear();
    for (const auto& peer_key : keys)
    {
        std::array<uint8_t, 32> key{};
        std::memcpy(key.data(), peer_key.public_key, key.size());
        node_public_keys_[peer_key.node_id.value] = key;
        node_key_last_seen_[peer_key.node_id.value] = peer_key.updated_at_ms;
    }
}

void MeshtasticRadioAdapter::savePkiNodeKey(::chat::NodeId node_id,
                                            const uint8_t* key,
                                            size_t key_len)
{
    if (node_id == 0)
    {
        return;
    }

    if (!key || key_len != 32)
    {
        logMeshtasticRx("[gat562][mt] ignore invalid pki key node=%08lX len=%u\n",
                        static_cast<unsigned long>(node_id),
                        static_cast<unsigned>(key_len));
        return;
    }

    std::array<uint8_t, 32> key_copy{};
    std::memcpy(key_copy.data(), key, key_copy.size());

    auto it = node_public_keys_.find(node_id);
    const bool existed = (it != node_public_keys_.end());
    const bool changed = !existed || (it->second != key_copy);

    if (changed)
    {
        node_public_keys_[node_id] = key_copy;
        markPkiKeysDirty();

        logMeshtasticRx("[gat562][mt] pki key updated node=%08lX\n",
                        static_cast<unsigned long>(node_id));
    }

