manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    // 鏃犺 key 鏄惁鍙樺寲锛岄兘鍒锋柊鏈€杩戠湅鍒拌鑺傜偣鍏挜鐨勬椂闂?    touchPkiNodeKey(node_id);
}

void MeshtasticRadioAdapter::markPkiKeysDirty()
{
    pki_node_keys_dirty_ = true;
    pki_node_keys_save_due_ms_ = millis() + kPkiNodeSaveDebounceMs;
}

void MeshtasticRadioAdapter::forgetNodePublicKey(::chat::NodeId node_id)
{
    if (node_id == 0)
    {
        return;
    }

    node_public_keys_.erase(node_id);
    node_key_last_seen_.erase(node_id);
    node_last_channel_.erase(node_id);
    nodeinfo_reply_ms_.erase(node_id);
    markPkiKeysDirty();
}

bool MeshtasticRadioAdapter::savePkiKeysToPrefs()
{
    std::vector<::mesh::PeerPublicKey> entries;
    entries.reserve(node_public_keys_.size());
    for (const auto& item : node_public_keys_)
    {
        ::mesh::PeerPublicKey entry{};
        entry.node_id = ::mesh::NodeId{item.first};
        auto seen_it = node_key_last_seen_.find(item.first);
        entry.updated_at_ms = (seen_it != node_key_last_seen_.end()) ? seen_it->second : 0;
        entry.verified = false;
        std::memcpy(entry.public_key, item.second.data(), sizeof(entry.public_key));
        entries.push_back(entry);
    }

    if (entries.size() > kMaxPkiNodes)
    {
        std::sort(entries.begin(), entries.end(),
                  [](const ::mesh::PeerPublicKey& a, const ::mesh::PeerPublicKey& b)
                  {
                      return a.updated_at_ms < b.updated_at_ms;
                  });
        const size_t drop = entries.size() - kMaxPkiNodes;
        for (size_t i = 0; i < drop; ++i)
        {
            node_public_keys_.erase(entries[i].node_id.value);
            node_key_last_seen_.erase(entries[i].node_id.value);
        }
        entries.erase(entries.begin(), entries.begin() + static_cast<long>(drop));
    }

    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    auto saved = store.replaceAll(entries.empty() ? nullptr : entries.data(), entries.size());
    if (saved.ok)
    {
        pki_node_keys_dirty_ = false;
    }
    return saved.ok;
}

void MeshtasticRadioAdapter::touchPkiNodeKey(::chat::NodeId node_id)
{
    node_key_last_seen_[node_id] = nowSeconds();
}

bool MeshtasticRadioAdapter::decryptPkiPayload(::chat::NodeId from, ::chat::MessageId packet_id,
                                               const uint8_t* cipher, size_t cipher_len,
                                               uint8_t* out_plain, size_t* out_plain_len)
{
    if (!cipher || cipher_len <= 12 || !out_plain || !out_plain_len || !pki_ready_)
    {
        return false;
    }

    auto it = node_public_keys_.find(from);
    if (it == node_public_keys_.end())
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyMissing,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

    touchPkiNodeKey(from);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, it->second.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint8_t* auth = cipher + (cipher_len - 12);
    uint32_t extra_nonce = 0;
    std::memcpy(&extra_nonce, auth + 8, sizeof(extra_nonce));

    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(from, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t plain_len = cipher_len - 12;
    if (*out_plain_len < plain_len)
    {
        *out_plain_len = plain_len;
        return false;
    }
    if (!::chat::meshtastic::decryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              cipher, plain_len, nullptr, 0, auth, out_plain))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

    *out_plain_len = plain_len;
    return true;
}

bool MeshtasticRadioAdapter::encryptPkiPayload(::chat::NodeId dest, ::chat::MessageId packet_id,
                                               const uint8_t* plain, size_t plain_len,
                                               uint8_t* out_cipher, size_t* out_cipher_len)
{
    if (!plain || !out_cipher || !out_cipher_len || !pki_ready_)
    {
        return false;
    }

    auto it = node_public_keys_.find(dest);
    if (it == node_public_keys_.end())
    {
        return false;
    }

    touchPkiNodeKey(dest);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, it->second.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint32_t extra_nonce = static_cast<uint32_t>(random());
    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(node_id_, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t needed = plain_len + 8 + sizeof(extra_nonce);
    if (*out_cipher_len < needed)
    {
        *out_cipher_len = needed;
        return false;
    }

    uint8_t auth[16] = {};
    if (!::chat::meshtastic::encryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              nullptr, 0,
                                              plain, plain_len,
                                              out_cipher, auth))
    {
        return false;
    }

    std::memcpy(out_cipher + plain_len, auth, 8);
    std::memcpy(out_cipher + plain_len + 8, &extra_nonce, sizeof(extra_nonce));
    *out_cipher_len = needed;
    return true;
}

void MeshtasticRadioAdapter::updateKeyVerificationState()
{
    if (kv_state_ == KeyVerificationState::Idle)
    {
        return;
    }
    const uint32_t now_ms = millis();
    if (kv_nonce_ms_ != 0 && (now_ms - kv_nonce_ms_) > kKeyVerificationTimeoutMs)
    {
        resetKeyVerificationState();
        return;
    }
    kv_nonce_ms_ = now_ms;
}

void MeshtasticRadioAdapter::resetKeyVerificationState()
{
    kv_state_ = KeyVerificationState::Idle;
    kv_nonce_ = 0;
    kv_nonce_ms_ = 0;
    kv_security_number_ = 0;
    kv_remote_node_ = 0;
    kv_hash1_.fill(0);
    kv_hash2_.fill(0);
}

void MeshtasticRadioAdapter::buildVerificationCode(char* out, size_t out_len) const
{
    if (!out || out_len < 10)
    {
        if (out && out_len > 0)
        {
            out[0] = '\0';
        }
        return;
    }
    for (int i = 0; i < 4; ++i)
    {
        out[i] = static_cast<char>((kv_hash1_[i] >> 2) + '0');
        out[i + 5] = static_cast<char>((kv_hash1_[i + 4] >> 2) + '0');
    }
    out[4] = ' ';
    out[9] = '\0';
}

