manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool MeshtasticRadioAdapter::handleKeyVerificationInit(const ::chat::meshtastic::PacketHeaderWire& header,
                                                       const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::Idle || header.to != node_id_ || header.to == kBroadcastNode || !pki_ready_)
    {
        return false;
    }
    auto key_it = node_public_keys_.find(header.from);
    if (key_it == node_public_keys_.end())
    {
        return false;
    }

    kv_nonce_ = kv.nonce;
    kv_nonce_ms_ = millis();
    kv_remote_node_ = header.from;
    kv_security_number_ = static_cast<uint32_t>(random(1, 1000000));
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      kv_remote_node_,
                                      node_id_,
                                      key_it->second.data(),
                                      key_it->second.size(),
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      kv_hash1_.data(),
                                      kv_hash2_.data()))
    {
        resetKeyVerificationState();
        return false;
    }

    meshtastic_KeyVerification reply = meshtastic_KeyVerification_init_zero;
    reply.nonce = kv_nonce_;
    reply.hash2.size = static_cast<pb_size_t>(kv_hash2_.size());
    std::memcpy(reply.hash2.bytes, kv_hash2_.data(), kv_hash2_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, reply, false))
    {
        resetKeyVerificationState();
        return false;
    }

    kv_state_ = KeyVerificationState::ReceiverAwaitingHash1;
    sys::EventBus::publish(new sys::KeyVerificationNumberInformEvent(kv_remote_node_, kv_nonce_, kv_security_number_), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationReply(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderInitiated ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 0 || kv.hash2.size != 32)
    {
        return false;
    }

    std::memcpy(kv_hash2_.data(), kv.hash2.bytes, kv_hash2_.size());
    kv_state_ = KeyVerificationState::SenderAwaitingNumber;
    kv_nonce_ms_ = millis();
    sys::EventBus::publish(new sys::KeyVerificationNumberRequestEvent(kv_remote_node_, kv_nonce_), 0);
    return true;
}

bool MeshtasticRadioAdapter::processKeyVerificationNumber(::chat::NodeId remote_node, uint64_t nonce, uint32_t number)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderAwaitingNumber ||
        kv_remote_node_ != remote_node || kv_nonce_ != nonce)
    {
        return false;
    }

    auto key_it = node_public_keys_.find(remote_node);
    if (key_it == node_public_keys_.end())
    {
        resetKeyVerificationState();
        return false;
    }

    std::array<uint8_t, 32> scratch_hash{};
    kv_security_number_ = number;
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      node_id_,
                                      kv_remote_node_,
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      key_it->second.data(),
                                      key_it->second.size(),
                                      kv_hash1_.data(),
                                      scratch_hash.data()))
    {
        return false;
    }
    if (std::memcmp(scratch_hash.data(), kv_hash2_.data(), kv_hash2_.size()) != 0)
    {
        return false;
    }

    meshtastic_KeyVerification response = meshtastic_KeyVerification_init_zero;
    response.nonce = kv_nonce_;
    response.hash1.size = static_cast<pb_size_t>(kv_hash1_.size());
    std::memcpy(response.hash1.bytes, kv_hash1_.data(), kv_hash1_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, response, true))
    {
        return false;
    }

    kv_state_ = KeyVerificationState::SenderAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, true, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationFinal(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::ReceiverAwaitingHash1 ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 32 || kv.hash2.size != 0)
    {
        return false;
    }
    if (std::memcmp(kv.hash1.bytes, kv_hash1_.data(), kv_hash1_.size()) != 0)
    {
        return false;
    }

    kv_state_ = KeyVerificationState::ReceiverAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, false, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::sendKeyVerificationPacket(::chat::NodeId dest, const meshtastic_KeyVerification& kv,
                                                       bool want_response)
{
    if (!pki_ready_ || !hasPkiKey(dest))
    {
        return false;
    }

    uint8_t kv_buf[96] = {};
    pb_ostream_t kv_stream = pb_ostream_from_buffer(kv_buf, sizeof(kv_buf));
    if (!pb_encode(&kv_stream, meshtastic_KeyVerification_fields, &kv))
    {
        return false;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.aux_data.begin(), scratch.aux_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);

