manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    uint8_t* data_buf = scratch.app_data.data();
    size_t data_size = scratch.app_data.size();
    if (!::chat::meshtastic::encodeAppData(meshtastic_PortNum_KEY_VERIFICATION_APP,
                                           kv_buf,
                                           kv_stream.bytes_written,
                                           want_response,
                                           data_buf,
                                           &data_size))
    {
        return false;
    }

    uint8_t* pki_buf = scratch.aux_data.data();
    size_t pki_len = scratch.aux_data.size();
    const ::chat::MessageId packet_id = next_packet_id_++;
    if (!encryptPkiPayload(dest, packet_id, data_buf, data_size, pki_buf, &pki_len))
    {
        return false;
    }

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    if (!::chat::meshtastic::buildWirePacket(pki_buf, pki_len,
                                             node_id_, packet_id,
                                             dest, 0, config_.hop_limit, false,
                                             nullptr, 0, wire, &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire, wire_size, ::chat::ChannelId::PRIMARY, nullptr, false, true);
}

std::string MeshtasticRadioAdapter::mqttNodeIdString() const
{
    char node_id[16];
    snprintf(node_id, sizeof(node_id), "!%08lx", static_cast<unsigned long>(node_id_));
    return std::string(node_id);
}

const char* MeshtasticRadioAdapter::mqttChannelIdFor(::chat::ChannelId channel) const
{
    return ::chat::meshtastic::mqttChannelIdFor(mqtt_proxy_settings_, channel);
}

bool MeshtasticRadioAdapter::hasAnyMqttDownlinkEnabled() const
{
    return ::chat::meshtastic::hasAnyMqttDownlinkEnabled(mqtt_proxy_settings_);
}

bool MeshtasticRadioAdapter::shouldPublishToMqtt(::chat::ChannelId channel, bool from_mqtt, bool is_pki) const
{
    return ::chat::meshtastic::shouldPublishToMqtt(
        mqtt_proxy_settings_, channel, from_mqtt, is_pki);
}

uint8_t MeshtasticRadioAdapter::mqttChannelHashForId(const char* channel_id, bool* out_known,
                                                     ::chat::ChannelId* out_channel) const
{
    const auto match =
        ::chat::meshtastic::resolveMqttProxyDownlinkChannel(mqtt_proxy_settings_, channel_id);
    bool known = match.known;
    ::chat::ChannelId channel = match.channel;
    size_t key_len = 0;
    const uint8_t* key = nullptr;
    uint8_t hash = 0;

    if (match.pki)
    {
        hash = 0;
    }
    else if (match.known && match.channel == ::chat::ChannelId::PRIMARY)
    {
        key = selectKey(config_, ::chat::ChannelId::PRIMARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::PRIMARY),
            key,
            key_len);
    }
    else if (match.known && match.channel == ::chat::ChannelId::SECONDARY)
    {
        key = selectKey(config_, ::chat::ChannelId::SECONDARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::SECONDARY),
            key,
            key_len);
    }

    if (out_known)
    {
        *out_known = known;
    }
    if (out_channel)
    {
        *out_channel = channel;
    }
    return hash;
}

bool MeshtasticRadioAdapter::decodeMqttServiceEnvelope(const uint8_t* payload, size_t payload_len,
                                                       meshtastic_MeshPacket* out_packet,
                                                       char* out_channel_id, size_t channel_id_len,
                                                       char* out_gateway_id, size_t gateway_id_len) const
{
    if (!payload || payload_len == 0 || !out_packet || !out_channel_id || !out_gateway_id ||
        channel_id_len == 0 || gateway_id_len == 0)
    {
        return false;
    }

    *out_packet = meshtastic_MeshPacket_init_zero;
    out_channel_id[0] = '\0';
    out_gateway_id[0] = '\0';

    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    while (stream.bytes_left > 0)
    {
        pb_wire_type_t wire_type = PB_WT_VARINT;
        uint32_t tag = 0;
        bool eof = false;
        if (!pb_decode_tag(&stream, &wire_type, &tag, &eof))
        {
            return false;
        }
        if (eof)
        {
            break;
        }

        if (tag == meshtastic_ServiceEnvelope_packet_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = pb_decode(&substream, meshtastic_MeshPacket_fields, out_packet);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_channel_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_channel_id, channel_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_gateway_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_gateway_id, gateway_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (!pb_skip_field(&stream, wire_type))
        {
            return false;
        }
    }

