manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    handleRawPacket(wire_buffer, wire_size);
    return true;
}

bool MeshtasticRadioAdapter::queueMqttProxyPublish(const meshtastic_MeshPacket& packet,
                                                   const char* channel_id)
{
    if (!::chat::meshtastic::mqttProxyRuntimeEnabled(mqtt_proxy_settings_) ||
        !channel_id || *channel_id == '\0')
    {
        return false;
    }

    auto& scratch = mqtt_publish_scratch_;
    std::memset(&scratch.proxy, 0, sizeof(scratch.proxy));
    std::memset(&scratch.envelope, 0, sizeof(scratch.envelope));
    std::string node_id = mqttNodeIdString();
    meshtastic_ServiceEnvelope& env = scratch.envelope;
    env.packet = const_cast<meshtastic_MeshPacket*>(&packet);
    env.channel_id = const_cast<char*>(channel_id);
    env.gateway_id = const_cast<char*>(node_id.c_str());

    pb_ostream_t estream = pb_ostream_from_buffer(scratch.proxy.payload_variant.data.bytes,
                                                  sizeof(scratch.proxy.payload_variant.data.bytes));
    if (!pb_encode(&estream, meshtastic_ServiceEnvelope_fields, &env))
    {
        return false;
    }

    meshtastic_MqttClientProxyMessage& proxy = scratch.proxy;
    proxy.which_payload_variant = meshtastic_MqttClientProxyMessage_data_tag;
    const std::string root = mqtt_proxy_settings_.root.empty() ? std::string("msh") : mqtt_proxy_settings_.root;
    const std::string topic = root + "/2/e/" + channel_id + "/" + node_id;
    std::strncpy(proxy.topic, topic.c_str(), sizeof(proxy.topic) - 1);
    proxy.topic[sizeof(proxy.topic) - 1] = '\0';
    proxy.payload_variant.data.size = static_cast<pb_size_t>(estream.bytes_written);
    proxy.retained = false;

    bool dropped = false;
    mqtt_proxy_queue_.pushDropOldest(proxy, &dropped);
    logMeshtasticRx("[gat562][mt][mqtt] queued topic=%s env=%u variant=%u port=%u q=%u\n",
                    proxy.topic,
                    static_cast<unsigned>(proxy.payload_variant.data.size),
                    static_cast<unsigned>(packet.which_payload_variant),
                    packet.which_payload_variant == meshtastic_MeshPacket_decoded_tag
                        ? static_cast<unsigned>(packet.decoded.portnum)
                        : 0U,
                    static_cast<unsigned>(mqtt_proxy_queue_.size()));
    if (dropped)
    {
        logMeshtasticRx("[gat562][mt][mqtt] queue dropped oldest depth=%u\n",
                        static_cast<unsigned>(mqtt_proxy_queue_.size()));
    }
    return true;
}

bool MeshtasticRadioAdapter::queueMqttProxyPublishFromWire(const uint8_t* wire_data,
                                                           size_t wire_size,
                                                           const meshtastic_Data* decoded,
                                                           ::chat::ChannelId channel_index)
{
    if (!wire_data || wire_size < sizeof(::chat::meshtastic::PacketHeaderWire))
    {
        return false;
    }

    ::chat::meshtastic::PacketHeaderWire header{};
    auto& scratch = mqtt_publish_scratch_;
    std::fill(scratch.buffer.begin(), scratch.buffer.end(), 0);
    size_t payload_size = scratch.buffer.size();
    if (!::chat::meshtastic::parseWirePacket(wire_data, wire_size, &header, scratch.buffer.data(), &payload_size))
    {
        return false;
    }

    const bool from_mqtt = (header.flags & ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK) != 0;
    const bool is_pki = (header.channel == 0);
    if (!shouldPublishToMqtt(channel_index, from_mqtt, is_pki))
    {
        return false;
    }

    const char* channel_id = is_pki ? "PKI" : mqttChannelIdFor(channel_index);
    if (!channel_id || *channel_id == '\0')
    {
        return false;
    }

    if (mqtt_proxy_settings_.encryption_enabled)
    {
        std::memset(&scratch.packet, 0, sizeof(scratch.packet));
        if (!makeEncryptedPacketFromWire(wire_data, wire_size, &scratch.packet))
        {
            return false;
        }
        return queueMqttProxyPublish(scratch.packet, channel_id);
    }

    if (!decoded)
    {
        return false;
    }

    std::memset(&scratch.packet, 0, sizeof(scratch.packet));
    fillDecodedPacketCommon(&scratch.packet, *decoded, header, channel_index);
    return queueMqttProxyPublish(scratch.packet, channel_id);
}

} // namespace platform::nrf52::arduino_common::chat::meshtastic
